import os
os.system('clear') 

r ="\033[0;31m"
print(r+'┏━━━┓┃┃┃┓┃┃┃┃┃┃┃┃┃┃┃┃┃┃┓┃┃┃┃┃┃┃┃┃┃┃┏┓┃┃┃┃┓┃┃') 
print(r+'┃┏━┓┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┛┗┓┃┃┃┃┃┃') 
print(r+'┃┃┃┗┛━━┓┗━┓━┓━━┓┃┃┃┃━━┓┃┃┓┃┏┓━━┓┓┏┓┓┏┛┓┏┓┗━┓') 
print(r+'┃┃┃┏┓┏┓┃┏┓┃┏┛┃┓┃┃┃┃┃┏┓┃┃┃┃┃┃┃┏┓┃┃┃┃┃┃┃┃┃┃┏┓┃') 
print(r+'┃┗━┛┃┗┛┃┗┛┃┃┃┗┛┗┓┃┃┃┃━┫┗┓┗━┛┃┗┛┃┗┛┃┃┗┓┗┛┃┗┛┃') 
print(r+'┗━━━┛━━┛━━┛┛┃━━━┛┃┃┃━━┛━┛━┓┏┛━━┛━━┛┗━┛━━┛━━┛') 
print(r+'┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃━┛┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃')
print(r+'┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃━━┛┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃┃') 
import socket
import sys
g ='\033[0;32m'
print(g+'type link website Ex: www.facebook.com:') 
name = input(g+'»»»»» ') 
ip=socket.gethostbyname(name)
print(r+'ip website is:»»» '+ ip)
y='\033[1;33m' 
print(y+" 👽cobra elyoutuber👽 LOVE YOU♥") 